experiments/guard-d29-revert333-srcdir-fullsmoke10-20260707-1126/raw/throughput_16-32K_rep1.log
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f1cccfcc820>, trust_remote_code=False, seed=0, num_prompts=10, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='/root/Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./test/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-b4943bd3-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-07 12:02:28 [datasets.py:232] Skipping oversampling. Total samples: 10.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:52<00:00, 26.23s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 10/10 [06:47<00:00, 40.77s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     10        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  407.70    
Total input tokens:                      212553    
Total generated tokens:                  1830      
Request throughput (req/s):              0.02      
Output token throughput (tok/s):         4.49      
Peak output token throughput (tok/s):    14.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          525.84    
---------------Time to First Token----------------
Mean TTFT (ms):                          27029.01  
Median TTFT (ms):                        26538.07  
P50 TTFT (ms):                           26538.07  
P95 TTFT (ms):                           30695.90  
P99 TTFT (ms):                           30887.77  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.61     
Median TPOT (ms):                        72.88     
P50 TPOT (ms):                           72.88     
P95 TPOT (ms):                           76.91     
P99 TPOT (ms):                           76.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.72     
Median ITL (ms):                         73.86     
P50 ITL (ms):                            73.86     
P95 ITL (ms):                            82.67     
P99 ITL (ms):                            87.38     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          40702.68  
Median E2EL (ms):                        30346.60  
P50 E2EL (ms):                           30346.60  
P95 E2EL (ms):                           82368.39  
P99 E2EL (ms):                           103941.99 
==================================================

===== result files =====
./test/4-8K_throughput/result.json
./test/8-16K_throughput/result.json
./test/16-32K_throughput/result.json